app/controllers/movies_controller.rb

    def index
      @title_class = 'text-info'
      @release_class = 'text-info'

      @movies = Movie.all
      @all_ratings = Movie.distinct.pluck(:rating)

      if params.has_key?(:ratings)
        @movies = @movies.where(rating: params[:ratings].keys)
        @ratings = params[:ratings].keys
      elsif params.has_key?(:commit) && params[:commit] == 'Refresh'
        @movies = []
        @ratings = []
      else
        @ratings = Movie.distinct.pluck(:rating)
      end

      if params[:column] == 'Title'
        @movies = @movies.order('title': :asc)
        @title_class = 'hilite text-dark'
      elsif params[:column] == 'Release'
        @movies = @movies.order('release_date': :asc)
---
SELECT "movies".* FROM "movies"
SELECT DISTINCT "movies"."rating" FROM "movies"
SELECT "movies".* FROM "movies" WHERE "movies"."rating" = ?  [["rating", "G"]]
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R')  ORDER BY "movies"."title" ASC
SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R')  ORDER BY "movies"."release_date" ASC